#include<stdio.h>
int main()
{
	int ball[12][4] = { {1,0,0,1},{-1,1,0,2},{0,1,0,3},{1,1,0,4},{-1,-1,1,5},{0,-1,1,6},
	{-1,1,-1,7},{-1,0,1,8},{0,0,-1,9},{1,0,1,10},{1,-1,-1,11},{0,-1,-1,12} };
	//将小球进行编号，分别表示为三元数组，且行和为1

	int left[4];
	int right[4];
	int None_place[4];

	int i, k, x;
	int j = 0;
	int output[3] = { 0 };/*记录结果的参量*/
	//开始测量，分为1、2、3次,k值表示称重的次数
	printf("由信息论的知识可知，称重三次可以测出非标准球以及轻重,将小球编号为１至１２，请按实际情况输入测量结果,否则将不能判断出假球");
	for (k = 0; k < 3; k++)
	{
		j = 0;
		for (i = 0; i < 12; i++)
		{
			if (ball[i][k] == -1)
			{
				left[j] = ball[i][3];
				j++;
			}
		}/*如果三元数组第k个值是-1的就将它放在左盘中*/
		j = 0;
		for (i = 0; i < 12; i++)
		{
			if (ball[i][k] == 1)
			{
				right[j] = ball[i][3];
				j++;
			}
		}
		/*如果三元数组第k个值是1的就将它放在右盘中*/
		j = 0;
		for (i = 0; i < 12; i++)
		{
			if (ball[i][k] == 0)
			{
				None_place[j] = ball[i][3];
				j++;
			}
		}
		/*如果三元数组第k个值是0的则不进行称重*/
		printf("第%d次左右盘的小球编号如下：\n", k + 1);
		printf("左盘小球编号：");
		for (i = 0; i < 4; i++)
		{
			printf("%3d", left[i]);

		}
		printf("\n");
		printf("右盘小球编号：");
		for (i = 0; i < 4; i++)
		{
			printf("%3d", right[i]);

		}
		printf("\n\n");
		printf("请输入第%d次的测量结果,0代表两边一样重，1代表左盘重，-1代表右盘重\n", k + 1);
		scanf("%d", &output[k]);
	}
	/*根据三次称重的结果,来判断哪个是非标准球，以及是轻是重。称重的三元数组若与ball中的数组相同，
         则该球为非标准球，且重于其他硬币；若与ball中的数组正好相反，则该球为非标准球，且轻于其他球。*/
	for (i = 0; i < 12; i++)
	{
		if (output[0] == ball[i][0] && output[1] == ball[i][1] && output[2] == ball[i][2])
		{
			printf("%d号是非标准球，且该球重于其他球\n", ball[i][3]);
		}
	}
	for (i = 0; i < 12; i++)
	{
		if (output[0] ==- ball[i][0] && output[1] == -ball[i][1] && output[2] ==- ball[i][2])
		{
			printf("%d号是非标准球，且该球轻于其他球\n", ball[i][3]);	
		}
	}
	
	
		if (output[0] == 0&& output[1] == 0 && output[2] == 0)	
		{
			printf("没有非标准球");
		}
	

}
